--Объявляю жанры
insert into title(name)
values 
	('Classical'),
	('Rock'),
	('Pop'),
	('Hip-hop'),
	('Metal');

--Объявляю исполнителей
insert into performer(name)
values
--Рок
	('Порнофильм'),
-- Классика
	('Алексей Айги'),
-- Метал
	('Sabaton'),
-- Поп
	('The Limba'),
	('Канги'),
	('VERBEE'),
-- Хип-хоп
	('Макс Корж'),
	('Miyagi & Andy Panda');

-- Устонавливаю свзяь жанров и исполнителей
insert into con_titles_per(title_id , performer_id)
values 
	(1, 2),
	(2, 1),
	(5, 3),
	(3, 4),
	(3, 5),
	(3, 6),
	(4, 7),
	(4, 8);

--Объявляю альбомы
insert into album(name, year_of_release)
values 
	('В диапазоне между отчаянием и надеждой', 2017),
	('Heroes', 2014),
	('Live in Moscow', 2015),
	('Грустно каждый день', 2021),
	('Простой', 2019),
	('Мы едем домой', 2018),
	('YAMAKASI', 2020),
	('Малый повзрослел. Часть 1', 2016),
	('Малый повзрослел. Часть 2', 2017);

-- Устонавливаю свзяь исполнителей и альюомов
insert into con_per_albums(performer_id, album_id)
values 
	(1, 1),
	(3, 2),
	(2, 3),
	(5, 4),
	(6, 5),
	(4, 6),
	(8, 7),
	(7, 8),
	(7, 9);

--Объявляю треки и связываю с альбомами
--Макс корж Ч1
insert into track(album_id, name, duration)
values(8, 'Свое заберу', 3.9),
	(8, 'Малый повзрослел', 3.5),
	(8, 'Стилево', 1.8),
--Макс корж Ч2
	(9, 'Пьяный дождь', 3.3),
	(9, 'Малиновый закат', 3.0),
	(9, 'Горы по колено', 4),
--Miyagi & Andy Panda
	(7, 'Мало нам', 3.8),
	(7, 'Utopia', 3.5),
	(7, 'Atlant', 3.1),
--The Limba
	(6, 'Пламя', 3.6),
	(6, 'Медвежонок', 2.5),
	(6, 'Обманула', 2.75),
--Verbee
	(5, 'Улетай', 3.15),
	(5, 'Больше не ищи', 2.6),
	(5, 'Стараюсь', 2.3),
--Канги
	(4, 'Дурак', 3.0),
	(4, 'Найти тебя', 2.9),
	(4, 'Бросишь меня', 2.8),
--Порнофильмы
	(1, 'В диапазоне', 5.5),
	(1, 'Система', 3.8),
	(1, 'Россия для грустных', 3.0),
--Sabaton
	(2, 'Smoking Snakes', 3.2),
	(2, 'No Bullets Fly', 3.6),
	(2, 'Night Witches', 3.0),
--Алексей айги
	(3, '2015', 4.3),
	(3, 'Zakat', 6.6);

--Объявляю сборники
insert into collection(name, year_of_release)
values 
('Hit 2020', 2020),
('Hit 2021', 2021),
('Hit 2019', 2019),
('Hit 2018', 2018),
('Hit 2017', 2017),
('Hit 2016', 2016),
('Hit 2015', 2015),
('Hit 2014', 2014);

--Устанавливаю свзяь треко и сборников
insert into con_tracks_col(track_id, collection_id)
values 
(1, 7),
(2, 7),
(3, 7),
(4, 8),
(5, 8),
(6, 8),
(7, 5),
(8, 5),
(9, 5),
(10, 2),
(11, 2),
(12, 2),
(13, 3),
(14, 3),
(15, 3),
(16, 4),
(17, 4),
(18, 4),
(19, 1),
(20, 1),
(21, 1),
(22, 6),
(23, 6),
(24, 6),
(25, 5),
(26, 5);






